#ifndef __CONSTANTS_OUTPUTS__
#define __CONSTANTS_OUTPUTS__

#define EKRAN_LIST_OUTPUTS_FOR_RANGUVANNJA        (EKRAN_CONTROL_CTRL_PHASE + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_1                (EKRAN_TRANSFORMATOR_INFO_CONTROL + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_2                (EKRAN_RANGUVANNJA_OUTPUT_1 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_3                (EKRAN_RANGUVANNJA_OUTPUT_2 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_4                (EKRAN_RANGUVANNJA_OUTPUT_3 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_5                (EKRAN_RANGUVANNJA_OUTPUT_4 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_6                (EKRAN_RANGUVANNJA_OUTPUT_5 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_7                (EKRAN_RANGUVANNJA_OUTPUT_6 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_8                (EKRAN_RANGUVANNJA_OUTPUT_7 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_9                (EKRAN_RANGUVANNJA_OUTPUT_8 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_10               (EKRAN_RANGUVANNJA_OUTPUT_9 + 1)

#define MAX_ROW_LIST_OUTPUTS_FOR_RANGUVANNJA       NUMBER_OUTPUTS
#define MAX_ROW_RANGUVANNJA_OUTPUT                 NUMBER_TOTAL_SIGNAL_FOR_RANG

#define NAME_RANG_RU    \
  "  Блок.вкл.ВВ   ",   \
  " Сброс индикации",   \
  "   Сброс реле   ",   \
  " Местн./Дистанц.",   \
  "  Положение ВВ  ",   \
  "  Пуск к.1 АВР  ",   \
  "  Пуск к.2 АВР  ",   \
  "   Напр.с ТН1   ",   \
  "   Напр.с ТН2   ",   \
  "Откл.от вн.защит",   \
  "     Вкл.ВВ     ",   \
  " Контроль Вкл.  ",   \
  "    Откл.ВВ     ",   \
  " Контроль Откл. ",   \
  "   Привод ВВ    ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Неиспр.Общая  ",   \
  "  Неиспр.Авар.  ",   \
  " Работа Ан.Рег. ",   \
  " Работа Д.Рег.  ",   \
  " Откл.от защит  ",   \
  "   Работа БО    ",   \
  "   Работа БВ    ",   \
  " 1-я гр.уставок ",   \
  " 2-я гр.уставок ",   \
  " 3-я гр.уставок ",   \
  " 4-я гр.уставок ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "  Изм.настроек  ",   \
  " Вх.О-функции1  ",   \
  " Вых.О-функции1 ",   \
  " Вх.О-функции2  ",   \
  " Вых.О-функции2 ",   \
  " Вх.О-функции3  ",   \
  " Вых.О-функции3 ",   \
  " Вх.О-функции4  ",   \
  " Вых.О-функции4 ",   \
  " Вх.О-функции5  ",   \
  " Вых.О-функции5 ",   \
  " Вх.О-функции6  ",   \
  " Вых.О-функции6 ",   \
  " Вх.О-функции7  ",   \
  " Вых.О-функции7 ",   \
  " Вх.О-функции8  ",   \
  " Вых.О-функции8 ",   \
  " Уст.О-триггера1",   \
  " Сбр.О-триггера1",   \
  " Вых.О-триггера1",   \
  " Уст.О-триггера2",   \
  " Сбр.О-триггера2",   \
  " Вых.О-триггера2",   \
  " Уст.О-триггера3",   \
  " Сбр.О-триггера3",   \
  " Вых.О-триггера3",   \
  " Уст.О-триггера4",   \
  " Сбр.О-триггера4",   \
  " Вых.О-триггера4",   \
  "      О-И1      ",   \
  "      О-И2      ",   \
  "      О-И3      ",   \
  "      О-И4      ",   \
  "      О-И5      ",   \
  "      О-И6      ",   \
  "      О-И7      ",   \
  "      О-И8      ",   \
  "     О-ИЛИ1     ",   \
  "     О-ИЛИ2     ",   \
  "     О-ИЛИ3     ",   \
  "     О-ИЛИ4     ",   \
  "     О-ИЛИ5     ",   \
  "     О-ИЛИ6     ",   \
  "     О-ИЛИ7     ",   \
  "     О-ИЛИ8     ",   \
  "  О-Искл.ИЛИ1   ",   \
  "  О-Искл.ИЛИ2   ",   \
  "  О-Искл.ИЛИ3   ",   \
  "  О-Искл.ИЛИ4   ",   \
  "  О-Искл.ИЛИ5   ",   \
  "  О-Искл.ИЛИ6   ",   \
  "  О-Искл.ИЛИ7   ",   \
  "  О-Искл.ИЛИ8   ",   \
  "     О-НЕ1      ",   \
  "     О-НЕ2      ",   \
  "     О-НЕ3      ",   \
  "     О-НЕ4      ",   \
  "     О-НЕ5      ",   \
  "     О-НЕ6      ",   \
  "     О-НЕ7      ",   \
  "     О-НЕ8      ",   \
  "     О-НЕ9      ",   \
  "     О-НЕ10     ",   \
  "     О-НЕ11     ",   \
  "     О-НЕ12     ",   \
  "     О-НЕ13     ",   \
  "     О-НЕ14     ",   \
  "     О-НЕ15     ",   \
  "     О-НЕ16     ",   \
  " Ош.настр.р.лог.",   \
  "Нед.разн.напр.с.",   \
  " Нед.разн.фаз с.",   \
  "  Нед.разн.ч.с. ",   \
  "Нед.посл.фаз с.1",   \
  "Нед.посл.фаз с.2"

#define NAME_RANG_UA    \
  " Блок.ввімкн.ВВ ",   \
  " Скид.індикації ",   \
  "   Скид.реле    ",   \
  " Місц./Дистанц. ",   \
  "    Стан ВВ     ",   \
  "  Пуск к.1 АВР  ",   \
  "  Пуск к.2 АВР  ",   \
  "   Напр.з ТН1   ",   \
  "   Напр.з ТН2   ",   \
  "Вимк.від зовн.з.",   \
  "    Ввімк.ВВ    ",   \
  " Контроль Ввімк.",   \
  "    Вимк.ВВ     ",   \
  " Контроль Вимк. ",   \
  "   Привід ВВ    ",   \
  " Перев.Iв.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Вич.Ресурс ВВ  ",   \
  " Неспр.Загальна ",   \
  "  Неспр.Авар.   ",   \
  " Роб.Ан.Реєстр. ",   \
  " Роб.Д.Реєстр.  ",   \
  " Вимк.від зах.  ",   \
  " Робота БВимк.  ",   \
  " Робота БВвімк. ",   \
  " 1-а гр.уставок ",   \
  " 2-а гр.уставок ",   \
  " 3-а гр.уставок ",   \
  " 4-а гр.уставок ",   \
  " Інв.ДВ гр.уст. ",   \
  "Бл.гр.уст.від з.",   \
  " С.блк.Гот.до ТУ",   \
  "Готовність до ТУ",   \
  " Зм.налаштування",   \
  " Вх.В-функції1  ",   \
  " Вих.В-функції1 ",   \
  " Вх.В-функції2  ",   \
  " Вих.В-функції2 ",   \
  " Вх.В-функції3  ",   \
  " Вих.В-функції3 ",   \
  " Вх.В-функції4  ",   \
  " Вих.В-функції4 ",   \
  " Вх.В-функції5  ",   \
  " Вих.В-функції5 ",   \
  " Вх.В-функції6  ",   \
  " Вих.В-функції6 ",   \
  " Вх.В-функції7  ",   \
  " Вих.В-функції7 ",   \
  " Вх.В-функції8  ",   \
  " Вих.В-функції8 ",   \
  " Вст.В-триґера1 ",   \
  " Ск.В-триґера1  ",   \
  " Вих.В-триґера1 ",   \
  " Вст.В-триґера2 ",   \
  " Ск.В-триґера2  ",   \
  " Вих.В-триґера2 ",   \
  " Вст.В-триґера3 ",   \
  " Ск.В-триґера3  ",   \
  " Вих.В-триґера3 ",   \
  " Вст.В-триґера4 ",   \
  " Ск.В-триґера4  ",   \
  " Вих.В-триґера4 ",   \
  "      В-І1      ",   \
  "      В-І2      ",   \
  "      В-І3      ",   \
  "      В-І4      ",   \
  "      В-І5      ",   \
  "      В-І6      ",   \
  "      В-І7      ",   \
  "      В-І8      ",   \
  "     В-АБО1     ",   \
  "     В-АБО2     ",   \
  "     В-АБО3     ",   \
  "     В-АБО4     ",   \
  "     В-АБО5     ",   \
  "     В-АБО6     ",   \
  "     В-АБО7     ",   \
  "     В-АБО8     ",   \
  "  В-Викл.АБО1   ",   \
  "  В-Викл.АБО2   ",   \
  "  В-Викл.АБО3   ",   \
  "  В-Викл.АБО4   ",   \
  "  В-Викл.АБО5   ",   \
  "  В-Викл.АБО6   ",   \
  "  В-Викл.АБО7   ",   \
  "  В-Викл.АБО8   ",   \
  "     В-НЕ1      ",   \
  "     В-НЕ2      ",   \
  "     В-НЕ3      ",   \
  "     В-НЕ4      ",   \
  "     В-НЕ5      ",   \
  "     В-НЕ6      ",   \
  "     В-НЕ7      ",   \
  "     В-НЕ8      ",   \
  "     В-НЕ9      ",   \
  "     В-НЕ10     ",   \
  "     В-НЕ11     ",   \
  "     В-НЕ12     ",   \
  "     В-НЕ13     ",   \
  "     В-НЕ14     ",   \
  "     В-НЕ15     ",   \
  "     В-НЕ16     ",   \
  " Пом.нал.р.лог. ",   \
  "Нед.різн.напр.с.",   \
  " Нед.різн.фаз с.",   \
  "  Нед.різн.ч.с. ",   \
  "Нед.посл.фаз с.1",   \
  "Нед.посл.фаз с.2"

#define NAME_RANG_EN    \
  " ON CB Blocking ",   \
  "Indication Reset",   \
  "  Relay Reset   ",   \
  "  Local/Remote  ",   \
  "  State of CB   ",   \
  "  Пуск к.1 АВР  ",   \
  "  Пуск к.2 АВР  ",   \
  "   Напр.с ТН1   ",   \
  "   Напр.с ТН2   ",   \
  "Откл.от вн.защит",   \
  "     On CB      ",   \
  " On CB Control  ",   \
  "     Off CB     ",   \
  " Off CB Control ",   \
  "  CB Actuator   ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Total Fault   ",   \
  " Emergence Fault",   \
  "An.Rec.Operation",   \
  " D.Rec.Operation",   \
  " Откл.от защит  ",   \
  "Off CB Operation",   \
  " On CB Operation",   \
  " Pick-up Set 1  ",   \
  " Pick-up Set 2  ",   \
  " Pick-up Set 3  ",   \
  " Pick-up Set 4  ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "Changed settings",   \
  "    UDF1 In     ",   \
  "    UDF1 Out    ",   \
  "    UDF2 In     ",   \
  "    UDF2 Out    ",   \
  "    UDF3 In     ",   \
  "    UDF3 Out    ",   \
  "    UDF4 In     ",   \
  "    UDF4 Out    ",   \
  "    UDF5 In     ",   \
  "    UDF5 Out    ",   \
  "    UDF6 In     ",   \
  "    UDF6 Out    ",   \
  "    UDF7 In     ",   \
  "    UDF7 Out    ",   \
  "    UDF8 In     ",   \
  "    UDF8 Out    ",   \
  "UD Flip-Flop1 S.",   \
  "UD Flip-Flop1 R.",   \
  "UD Flip-Flop1 O.",   \
  "UD Flip-Flop2 S.",   \
  "UD Flip-Flop2 R.",   \
  "UD Flip-Flop2 O.",   \
  "UD Flip-Flop3 S.",   \
  "UD Flip-Flop3 R.",   \
  "UD Flip-Flop3 O.",   \
  "UD Flip-Flop4 S.",   \
  "UD Flip-Flop4 R.",   \
  "UD Flip-Flop4 O.",   \
  "    UD AND1     ",   \
  "    UD AND2     ",   \
  "    UD AND3     ",   \
  "    UD AND4     ",   \
  "    UD AND5     ",   \
  "    UD AND6     ",   \
  "    UD AND7     ",   \
  "    UD AND8     ",   \
  "     UD OR1     ",   \
  "     UD OR2     ",   \
  "     UD OR3     ",   \
  "     UD OR4     ",   \
  "     UD OR5     ",   \
  "     UD OR6     ",   \
  "     UD OR7     ",   \
  "     UD OR8     ",   \
  "    UD XOR1     ",   \
  "    UD XOR2     ",   \
  "    UD XOR3     ",   \
  "    UD XOR4     ",   \
  "    UD XOR5     ",   \
  "    UD XOR6     ",   \
  "    UD XOR7     ",   \
  "    UD XOR8     ",   \
  "    UD NOT1     ",   \
  "    UD NOT2     ",   \
  "    UD NOT3     ",   \
  "    UD NOT4     ",   \
  "    UD NOT5     ",   \
  "    UD NOT6     ",   \
  "    UD NOT7     ",   \
  "    UD NOT8     ",   \
  "    UD NOT9     ",   \
  "    UD NOT10    ",   \
  "    UD NOT11    ",   \
  "    UD NOT12    ",   \
  "    UD NOT13    ",   \
  "    UD NOT14    ",   \
  "    UD NOT15    ",   \
  "    UD NOT16    ",   \
  " Ош.настр.р.лог.",   \
  "Нед.разн.напр.с.",   \
  " Нед.разн.фаз с.",   \
  "  Нед.разн.ч.с. ",   \
  "Нед.посл.фаз с.1",   \
  "Нед.посл.фаз с.2"

#define NAME_RANG_KZ    \
  "  Блок.вкл.ВВ   ",   \
  " Сброс индикации",   \
  "   Сброс реле   ",   \
  " Местн./Дистанц.",   \
  "  Положение ВВ  ",   \
  "  Пуск к.1 АВР  ",   \
  "  Пуск к.2 АВР  ",   \
  "   Напр.с ТН1   ",   \
  "   Напр.с ТН2   ",   \
  "Откл.от вн.защит",   \
  "     Вкл.ВВ     ",   \
  " Контроль Вкл.  ",   \
  "    Откл.ВВ     ",   \
  " Контроль Откл. ",   \
  "   Привод ВВ    ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Неиспр.Общая  ",   \
  "  Неиспр.Авар.  ",   \
  " Работа Ан.Рег. ",   \
  " Работа Д.Рег.  ",   \
  " Откл.от защит  ",   \
  "   Работа БО    ",   \
  "   Работа БВ    ",   \
  " 1-я гр.уставок ",   \
  " 2-я гр.уставок ",   \
  " 3-я гр.уставок ",   \
  " 4-я гр.уставок ",   \
  " Инв.ДВ гр.уст. ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "  Изм.настроек  ",   \
  " Вх.О-функции1  ",   \
  " Вых.О-функции1 ",   \
  " Вх.О-функции2  ",   \
  " Вых.О-функции2 ",   \
  " Вх.О-функции3  ",   \
  " Вых.О-функции3 ",   \
  " Вх.О-функции4  ",   \
  " Вых.О-функции4 ",   \
  " Вх.О-функции5  ",   \
  " Вых.О-функции5 ",   \
  " Вх.О-функции6  ",   \
  " Вых.О-функции6 ",   \
  " Вх.О-функции7  ",   \
  " Вых.О-функции7 ",   \
  " Вх.О-функции8  ",   \
  " Вых.О-функции8 ",   \
  " Уст.О-триггера1",   \
  " Сбр.О-триггера1",   \
  " Вых.О-триггера1",   \
  " Уст.О-триггера2",   \
  " Сбр.О-триггера2",   \
  " Вых.О-триггера2",   \
  " Уст.О-триггера3",   \
  " Сбр.О-триггера3",   \
  " Вых.О-триггера3",   \
  " Уст.О-триггера4",   \
  " Сбр.О-триггера4",   \
  " Вых.О-триггера4",   \
  "      О-И1      ",   \
  "      О-И2      ",   \
  "      О-И3      ",   \
  "      О-И4      ",   \
  "      О-И5      ",   \
  "      О-И6      ",   \
  "      О-И7      ",   \
  "      О-И8      ",   \
  "     О-ИЛИ1     ",   \
  "     О-ИЛИ2     ",   \
  "     О-ИЛИ3     ",   \
  "     О-ИЛИ4     ",   \
  "     О-ИЛИ5     ",   \
  "     О-ИЛИ6     ",   \
  "     О-ИЛИ7     ",   \
  "     О-ИЛИ8     ",   \
  "  О-Искл.ИЛИ1   ",   \
  "  О-Искл.ИЛИ2   ",   \
  "  О-Искл.ИЛИ3   ",   \
  "  О-Искл.ИЛИ4   ",   \
  "  О-Искл.ИЛИ5   ",   \
  "  О-Искл.ИЛИ6   ",   \
  "  О-Искл.ИЛИ7   ",   \
  "  О-Искл.ИЛИ8   ",   \
  "     О-НЕ1      ",   \
  "     О-НЕ2      ",   \
  "     О-НЕ3      ",   \
  "     О-НЕ4      ",   \
  "     О-НЕ5      ",   \
  "     О-НЕ6      ",   \
  "     О-НЕ7      ",   \
  "     О-НЕ8      ",   \
  "     О-НЕ9      ",   \
  "     О-НЕ10     ",   \
  "     О-НЕ11     ",   \
  "     О-НЕ12     ",   \
  "     О-НЕ13     ",   \
  "     О-НЕ14     ",   \
  "     О-НЕ15     ",   \
  "     О-НЕ16     ",   \
  " Ош.настр.р.лог.",   \
  "Нед.разн.напр.с.",   \
  " Нед.разн.фаз с.",   \
  "  Нед.разн.ч.с. ",   \
  "Нед.посл.фаз с.1",   \
  "Нед.посл.фаз с.2"

#endif 
