#ifndef __CONSTANTS_INPUTS__
#define __CONSTANTS_INPUTS__

#define EKRAN_LIST_INPUTS_FOR_RANGUVANNJA        (EKRAN_CONTROL_CTRL_PHASE + 1)

#define EKRAN_RANGUVANNJA_INPUT_1                (EKRAN_TRANSFORMATOR_INFO_CONTROL + 1)
#define EKRAN_RANGUVANNJA_INPUT_2                (EKRAN_RANGUVANNJA_INPUT_1 + 1)
#define EKRAN_RANGUVANNJA_INPUT_3                (EKRAN_RANGUVANNJA_INPUT_2 + 1)
#define EKRAN_RANGUVANNJA_INPUT_4                (EKRAN_RANGUVANNJA_INPUT_3 + 1)
#define EKRAN_RANGUVANNJA_INPUT_5                (EKRAN_RANGUVANNJA_INPUT_4 + 1)
#define EKRAN_RANGUVANNJA_INPUT_6                (EKRAN_RANGUVANNJA_INPUT_5 + 1)
#define EKRAN_RANGUVANNJA_INPUT_7                (EKRAN_RANGUVANNJA_INPUT_6 + 1)
#define EKRAN_RANGUVANNJA_INPUT_8                (EKRAN_RANGUVANNJA_INPUT_7 + 1)
#define EKRAN_RANGUVANNJA_INPUT_9                (EKRAN_RANGUVANNJA_INPUT_8 + 1)
#define EKRAN_RANGUVANNJA_INPUT_10               (EKRAN_RANGUVANNJA_INPUT_9 + 1)

#define MAX_ROW_LIST_INPUTS_FOR_RANGUVANNJA       NUMBER_INPUTS
#define MAX_ROW_RANGUVANNJA_INPUT                 NUMBER_TOTAL_SIGNAL_FOR_RANG_INPUT

#define NAME_RANG_FOR_INPUTS_RU         \
  "  Блок.вкл.ВВ   ",                   \
  " Сброс индикации",                   \
  "   Сброс реле   ",                   \
  " Местн./Дистанц.",                   \
  "  Положение ВВ  ",                   \
  "  Пуск к.1 АВР  ",                   \
  "  Пуск к.2 АВР  ",                   \
  "Откл.от вн.защит",                   \
  "     Вкл.ВВ     ",                   \
  " Контроль Вкл.  ",                   \
  "    Откл.ВВ     ",                   \
  " Контроль Откл. ",                   \
  " 1-я гр.уставок ",                   \
  " 2-я гр.уставок ",                   \
  " 3-я гр.уставок ",                   \
  " 4-я гр.уставок ",                   \
  " С.блк.Гот.к ТУ ",                   \
  "   Блок.МТЗ1    ",                   \
  "   Блок.МТЗ2    ",                   \
  " Блок.уск.МТЗ2  ",                   \
  "   Блок.МТЗ3    ",                   \
  " Блок.уск.МТЗ3  ",                   \
  "   Блок.МТЗ4    ",                   \
  " Пуск ЗДЗ от ДВ ",                   \
  " Стат.блок.АПВ  ",                   \
  " Пуск УРОВ от ДВ",                   \
  " Блок.ЗОП(КОФ)  ",                   \
  "  Блок.ЗНмин1   ",                   \
  "  Пуск ЗНмин1   ",                   \
  "  Блок.ЗНмин2   ",                   \
  "  Пуск ЗНмин2   ",                   \
  "  Блок.ЗНмакс1  ",                   \
  "  Блок.ЗНмакс2  ",                   \
  "  Вн.Откл.АВР   ",                   \
  " Сброс Блок.АВР ",                   \
  " Стат.блок.АВР 1",                   \
  " Стат.блок.АВР 2",                   \
  "    ОЗТ 1к.     ",                   \
  "    ОЗТ 2к.     ",                   \
  " Вх.О-функции1  ",                   \
  " Вх.О-функции2  ",                   \
  " Вх.О-функции3  ",                   \
  " Вх.О-функции4  ",                   \
  " Вх.О-функции5  ",                   \
  " Вх.О-функции6  ",                   \
  " Вх.О-функции7  ",                   \
  " Вх.О-функции8  ",                   \
  " Уст.О-триггера1",                   \
  " Сбр.О-триггера1",                   \
  " Уст.О-триггера2",                   \
  " Сбр.О-триггера2",                   \
  " Уст.О-триггера3",                   \
  " Сбр.О-триггера3",                   \
  " Уст.О-триггера4",                   \
  " Сбр.О-триггера4"

#define NAME_RANG_FOR_INPUTS_UA         \
  " Блок.ввімкн.ВВ ",                   \
  " Скид.індикації ",                   \
  "   Скид.реле    ",                   \
  " Місц./Дистанц. ",                   \
  "    Стан ВВ     ",                   \
  "  Пуск к.1 АВР  ",                   \
  "  Пуск к.2 АВР  ",                   \
  "Вимк.від зовн.з.",                   \
  "    Ввімк.ВВ    ",                   \
  " Контроль Ввімк.",                   \
  "    Вимк.ВВ     ",                   \
  " Контроль Вимк. ",                   \
  " 1-а гр.уставок ",                   \
  " 2-а гр.уставок ",                   \
  " 3-а гр.уставок ",                   \
  " 4-а гр.уставок ",                   \
  " С.блк.Гот.до ТУ",                   \
  "   Блок.МСЗ1    ",                   \
  "   Блок.МСЗ2    ",                   \
  " Блок.приск.МСЗ2",                   \
  "   Блок.МСЗ3    ",                   \
  " Блок.приск.МСЗ3",                   \
  "   Блок.МСЗ4    ",                   \
  " Пуск ЗДЗ від ДВ",                   \
  " Стат.блок.АПВ  ",                   \
  "Пуск ПРВВ від ДВ",                   \
  " Блок.ЗЗП(КОФ)  ",                   \
  "  Блок.ЗНмин1   ",                   \
  "  Пуск ЗНмин1   ",                   \
  "  Блок.ЗНмин2   ",                   \
  "  Пуск ЗНмин2   ",                   \
  "  Блок.ЗНмакс1  ",                   \
  "  Блок.ЗНмакс2  ",                   \
  " Зовн.Вимк.АВР  ",                   \
  " Скид.Блок.АВР  ",                   \
  " Стат.блок.АВР 1",                   \
  " Стат.блок.АВР 2",                   \
  "    ОЗТ 1к.     ",                   \
  "    ОЗТ 2к.     ",                   \
  " Вх.В-функції1  ",                   \
  " Вх.В-функції2  ",                   \
  " Вх.В-функції3  ",                   \
  " Вх.В-функції4  ",                   \
  " Вх.В-функції5  ",                   \
  " Вх.В-функції6  ",                   \
  " Вх.В-функції7  ",                   \
  " Вх.В-функції8  ",                   \
  " Вст.В-триґера1 ",                   \
  " Ск.В-триґера1  ",                   \
  " Вст.В-триґера2 ",                   \
  " Ск.В-триґера2  ",                   \
  " Вст.В-триґера3 ",                   \
  " Ск.В-триґера3  ",                   \
  " Вст.В-триґера4 ",                   \
  " Ск.В-триґера4  "
    
#define NAME_RANG_FOR_INPUTS_EN         \
  " ON CB Blocking ",                   \
  "Indication Reset",                   \
  "  Relay Reset   ",                   \
  "  Local/Remote  ",                   \
  "  State of CB   ",                   \
  "  Пуск к.1 АВР  ",                   \
  "  Пуск к.2 АВР  ",                   \
  "Откл.от вн.защит",                   \
  "     On CB      ",                   \
  " On CB Control  ",                   \
  "     Off CB     ",                   \
  " Off CB Control ",                   \
  " Pick-up Set 1  ",                   \
  " Pick-up Set 2  ",                   \
  " Pick-up Set 3  ",                   \
  " Pick-up Set 4  ",                   \
  " С.блк.Гот.к ТУ ",                   \
  "  Blc.of OCP1   ",                   \
  "  Blc.of OCP2   ",                   \
  "  OCP2 Acc.Blc. ",                   \
  "  Blc.of OCP3   ",                   \
  "  OCP3 Acc.Blc. ",                   \
  "  Blc.of OCP4   ",                   \
  " Пуск ЗДЗ от ДВ ",                   \
  " Стат.блок.АПВ  ",                   \
  " CBFP Start f.DI",                   \
  "  Blc.of NPSP   ",                   \
  "   Блок.Umin1   ",                   \
  "   Пуск Umin1   ",                   \
  "   Блок.Umin2   ",                   \
  "   Пуск Umin2   ",                   \
  "   Блок.Umax1   ",                   \
  "   Блок.Umax2   ",                   \
  "  Вн.Откл.АВР   ",                   \
  " Сброс Блок.АВР ",                   \
  " Стат.блок.АВР 1",                   \
  " Стат.блок.АВР 2",                   \
  "    ОЗТ 1к.     ",                   \
  "    ОЗТ 2к.     ",                   \
  "    UDF1 In     ",                   \
  "    UDF2 In     ",                   \
  "    UDF3 In     ",                   \
  "    UDF4 In     ",                   \
  "    UDF5 In     ",                   \
  "    UDF6 In     ",                   \
  "    UDF7 In     ",                   \
  "    UDF8 In     ",                   \
  "UD Flip-Flop1 S.",                   \
  "UD Flip-Flop1 R.",                   \
  "UD Flip-Flop2 S.",                   \
  "UD Flip-Flop2 R.",                   \
  "UD Flip-Flop3 S.",                   \
  "UD Flip-Flop3 R.",                   \
  "UD Flip-Flop4 S.",                   \
  "UD Flip-Flop4 R."

#define NAME_RANG_FOR_INPUTS_KZ         \
  "  Блок.вкл.ВВ   ",                   \
  " Сброс индикации",                   \
  "   Сброс реле   ",                   \
  " Местн./Дистанц.",                   \
  "  Положение ВВ  ",                   \
  "  Пуск к.1 АВР  ",                   \
  "  Пуск к.2 АВР  ",                   \
  "Откл.от вн.защит",                   \
  "     Вкл.ВВ     ",                   \
  " Контроль Вкл.  ",                   \
  "    Откл.ВВ     ",                   \
  " Контроль Откл. ",                   \
  " 1-я гр.уставок ",                   \
  " 2-я гр.уставок ",                   \
  " 3-я гр.уставок ",                   \
  " 4-я гр.уставок ",                   \
  " С.блк.Гот.к ТУ ",                   \
  "   Блок.МТЗ1    ",                   \
  "   Блок.МТЗ2    ",                   \
  " Блок.уск.МТЗ2  ",                   \
  "   Блок.МТЗ3    ",                   \
  " Блок.уск.МТЗ3  ",                   \
  "   Блок.МТЗ4    ",                   \
  " Пуск ЗДЗ от ДВ ",                   \
  " Стат.блок.АПВ  ",                   \
  " Пуск УРОВ от ДВ",                   \
  " Блок.ЗОП(КОФ)  ",                   \
  "  Блок.ЗНмин1   ",                   \
  "  Пуск ЗНмин1   ",                   \
  "  Блок.ЗНмин2   ",                   \
  "  Пуск ЗНмин2   ",                   \
  "  Блок.ЗНмакс1  ",                   \
  "  Блок.ЗНмакс2  ",                   \
  "  Вн.Откл.АВР   ",                   \
  " Сброс Блок.АВР ",                   \
  " Стат.блок.АВР 1",                   \
  " Стат.блок.АВР 2",                   \
  "    ОЗТ 1к.     ",                   \
  "    ОЗТ 2к.     ",                   \
  " Вх.О-функции1  ",                   \
  " Вх.О-функции2  ",                   \
  " Вх.О-функции3  ",                   \
  " Вх.О-функции4  ",                   \
  " Вх.О-функции5  ",                   \
  " Вх.О-функции6  ",                   \
  " Вх.О-функции7  ",                   \
  " Вх.О-функции8  ",                   \
  " Уст.О-триггера1",                   \
  " Сбр.О-триггера1",                   \
  " Уст.О-триггера2",                   \
  " Сбр.О-триггера2",                   \
  " Уст.О-триггера3",                   \
  " Сбр.О-триггера3",                   \
  " Уст.О-триггера4",                   \
  " Сбр.О-триггера4"
    
#endif 
